api_tests/direct-debit-consents_consentId_delete_others.yaml
# ********RoostGPT********

# Test generated by RoostGPT for test artillery-UI-insights-test using AI Type Open AI and AI Model gpt-4
# 
# Test generated for /direct-debit-consents/{consentId}_delete for http method type DELETE in artillery framework
# RoostTestHash=f37b57ea61
# 
# 

# ********RoostGPT********
config:
  target: "{{ $processEnvironment.API_HOST }}"
  phases:
    - duration: 60
      arrivalRate: 10
  plugins:
    expect: {}
  payload:
    path: "direct-debit-consents_consentId_delete_others.csv"
    fields:
      - "consentId"
      - "authorization"
    skipHeader: true
    delimiter: "^|^"

scenarios:
  - name: "Non-success API requests"
    flow:
      - log: "Sending DELETE request with invalid consentId"
      - delete:
          url: "/direct-debit-consents/{{ consentId }}"
          headers:
            Authorization: "Bearer {{$processEnvironment.AUTH_TOKEN}}"
            x-fapi-auth-date: "Sun, 10 Sep 2017 19:43:31 UTC"
            x-fapi-customer-ip-address: "169.254.169.254"
            x-fapi-interaction-id: "{{$uuid}}"
            Accept-Language: "en-US"
          expect:
            - statusCode: 404
      - think: 1

      - log: "Sending DELETE request without authorization header"
      - delete:
          url: "/direct-debit-consents/{{ consentId }}"
          headers:
            x-fapi-auth-date: "Sun, 10 Sep 2017 19:43:31 UTC"
            x-fapi-customer-ip-address: "169.254.169.254"
            x-fapi-interaction-id: "{{$uuid}}"
            Accept-Language: "en-US"
          expect:
            - statusCode: 401
      - think: 1

      - log: "Sending DELETE request with invalid URL"
      - delete:
          url: "/invalid-url/{{ consentId }}"
          headers:
            Authorization: "Bearer {{$processEnvironment.AUTH_TOKEN}}"
            x-fapi-auth-date: "Sun, 10 Sep 2017 19:43:31 UTC"
            x-fapi-customer-ip-address: "169.254.169.254"
            x-fapi-interaction-id: "{{$uuid}}"
            Accept-Language: "en-US"
          expect:
            - statusCode: 404
      - think: 1