api_tests/direct-debit-consents_consentId_delete_success.yaml
# ********RoostGPT********

# Test generated by RoostGPT for test artillery-UI-insights-test using AI Type Open AI and AI Model gpt-4
# 
# Test generated for /direct-debit-consents/{consentId}_delete for http method type DELETE in artillery framework
# RoostTestHash=f37b57ea61
# 
# 

# ********RoostGPT********
config:
  target: "http://localhost:3000"  # Replace with your actual API host
  phases:
    - duration: 60
      arrivalRate: 20
  plugins:
    expect: {}
  payload:
    path: "direct-debit-consents_consentId_delete_success.csv"
    fields: ["consentId"]
    skipHeader: true

scenarios:
  - name: "Successful API Requests"
    flow:
      - log: "Deleting consent with valid consentId"
      - delete:
          url: "/direct-debit-consents/{{ consentId }}"
          headers:
            Authorization: "Bearer {{$processEnvironment.AUTH_TOKEN}}"
            x-fapi-auth-date: "Sun, 10 Sep 2017 19:43:31 UTC"
            x-fapi-customer-ip-address: "169.254.169.254"
            x-fapi-interaction-id: "unique-id"
            Accept-Language: "en-US"
      - expect:
          - statusCode: 204
          - hasHeader: "x-fapi-interaction-id"
      - think: 1