api_tests/instructions_post_success.yaml
# ********RoostGPT********

# Test generated by RoostGPT for test artillery-UI-insights-test using AI Type Open AI and AI Model gpt-4
# 
# Test generated for /instructions_post for http method type POST in artillery framework
# RoostTestHash=798f93a193
# 
# 

# ********RoostGPT********
config:
  target: "{{ $processEnvironment.API_HOST }}"
  plugins:
    expect: {}
  payload:
    path: "instructions_post_success.csv"
    fields:
      - "merchantInstructionIdentification"
      - "mandateIdentification"
      - "debtorName"
      - "debtorAccount.bankCode"
      - "debtorAccount.accountIdentification"
      - "debtorAccount.currency"
      - "debtorAccount.accountSchemeName"
      - "debtorAccount.accountSubType"
      - "creditorAccount.bankCode"
      - "creditorAccount.accountIdentification"
      - "creditorAccount.currency"
      - "creditorAccount.accountSchemeName"
      - "creditorAccount.accountSubType"
      - "creditorReference"
      - "instructedAmountCurrency"
      - "instructedAmount"
      - "remittanceInformation"
      - "smsLanguageCode"
    skipHeader: true
    delimiter: "^|^"
  phases:
    - duration: 60
      arrivalRate: 5
  defaults:
    headers:
      Authorization: "Bearer {{$processEnvironment.AUTH_TOKEN}}"
      x-fapi-customer-ip-address: "192.0.2.1"
      x-fapi-auth-date: "2022-01-01T00:00:00Z"
      x-fapi-interaction-id: "1"
      x-idempotency-key: "1"

scenarios:
  - name: "Post Instructions Success Scenario"
    flow:
      - log: "Posting instruction with valid payload"
      - post:
          url: "/instructions"
          headers:
            Content-Type: "application/json"
          json:
            merchantInstructionIdentification: "{{ merchantInstructionIdentification }}"
            mandateIdentification: "{{ mandateIdentification }}"
            debtorName: "{{ debtorName }}"
            debtorAccount:
              bankCode: "{{ debtorAccount.bankCode }}"
              accountIdentification: "{{ debtorAccount.accountIdentification }}"
              currency: "{{ debtorAccount.currency }}"
              accountSchemeName: "{{ debtorAccount.accountSchemeName }}"
              accountSubType: "{{ debtorAccount.accountSubType }}"
            creditorAccount:
              bankCode: "{{ creditorAccount.bankCode }}"
              accountIdentification: "{{ creditorAccount.accountIdentification }}"
              currency: "{{ creditorAccount.currency }}"
              accountSchemeName: "{{ creditorAccount.accountSchemeName }}"
              accountSubType: "{{ creditorAccount.accountSubType }}"
            creditorReference: "{{ creditorReference }}"
            instructedAmountCurrency: "{{ instructedAmountCurrency }}"
            instructedAmount: "{{ instructedAmount }}"
            remittanceInformation: "{{ remittanceInformation }}"
            smsLanguageCode: "{{ smsLanguageCode }}"
          expect:
            - statusCode: 201
            - hasProperty: "paymentInformationStatus"
            - hasProperty: "processResult"
            - hasProperty: "processResult.responseCode"
            - hasProperty: "processResult.rejectReasonList"
            - hasProperty: "transactionIdentification"
      - think: 1