api_tests/otpconfirmation_post_others.yaml
# ********RoostGPT********

# Test generated by RoostGPT for test artillery-UI-insights-test using AI Type Open AI and AI Model gpt-4
# 
# Test generated for /otpconfirmation_post for http method type POST in artillery framework
# RoostTestHash=3bab7c72fd
# 
# 

# ********RoostGPT********
config:
  target: "{{ $processEnvironment.API_HOST }}"
  plugins:
    expect: {}
  payload:
    path: "otpconfirmation_post_others.csv"
    fields: ["mandateIdentification", "otpIdentificationNumber", "otpPassword", "bankCode", "accountIdentification", "currency", "accountSchemeName", "accountSubType"]
    skipHeader: true
    delimiter: "^|^"
  environments:
    dev:
      target: "{{ $processEnvironment.API_HOST }}"
      http:
        timeout: 10
  phases:
    - duration: 60
      arrivalRate: 5

scenarios:
  - name: "Non-Success API Responses"
    flow:
      - log: "Sending invalid payload with missing fields"
      - post:
          url: "/otpconfirmation"
          headers:
            Authorization: "Bearer {{$processEnvironment.AUTH_TOKEN}}"
            x-fapi-customer-ip-address: "Invalid IP Address"
            x-fapi-auth-date: "Invalid Date"
            x-fapi-interaction-id: "Invalid Interaction ID"
            x-idempotency-key: "Invalid Idempotency Key"
          json:
            mandateIdentification: "{{ mandateIdentification }}"
            otpIdentificationNumber: "{{ otpIdentificationNumber }}"
            otpPassword: "{{ otpPassword }}"
            creditorAccount:
              bankCode: "{{ bankCode }}"
              accountIdentification: "{{ accountIdentification }}"
              currency: "{{ currency }}"
              accountSchemeName: "{{ accountSchemeName }}"
              accountSubType: "{{ accountSubType }}"
          expect:
            - statusCode: 400
            - hasProperty: "error"
      - think: 1
      - log: "Sending request to an incorrect URL"
      - post:
          url: "/otpconfirmtion"  # incorrect URL
          headers:
            Authorization: "Bearer {{$processEnvironment.AUTH_TOKEN}}"
            x-fapi-customer-ip-address: "Invalid IP Address"
            x-fapi-auth-date: "Invalid Date"
            x-fapi-interaction-id: "Invalid Interaction ID"
            x-idempotency-key: "Invalid Idempotency Key"
          json:
            mandateIdentification: "{{ mandateIdentification }}"
            otpIdentificationNumber: "{{ otpIdentificationNumber }}"
            otpPassword: "{{ otpPassword }}"
            creditorAccount:
              bankCode: "{{ bankCode }}"
              accountIdentification: "{{ accountIdentification }}"
              currency: "{{ currency }}"
              accountSchemeName: "{{ accountSchemeName }}"
              accountSubType: "{{ accountSubType }}"
          expect:
            - statusCode: 404
      - think: 1