api_tests/otpconfirmation_post_success.yaml
# ********RoostGPT********

# Test generated by RoostGPT for test artillery-UI-insights-test using AI Type Open AI and AI Model gpt-4
# 
# Test generated for /otpconfirmation_post for http method type POST in artillery framework
# RoostTestHash=3bab7c72fd
# 
# 

# ********RoostGPT********
config:
  target: $processEnvironment.API_HOST
  phases:
    - duration: 60
      arrivalRate: 20
  plugins:
    expect: {}
  payload:
    path: "otpconfirmation_post_success.csv"
    skipHeader: true
    fields:
      - "mandateIdentification"
      - "otpIdentificationNumber"
      - "otpPassword"
      - "bankCode"
      - "accountIdentification"
      - "currency"
      - "accountSchemeName"
      - "accountSubType"
    delimiter: "^|^"

scenarios:
  - name: "POST /otpconfirmation"
    flow:
      - log: "Starting POST /otpconfirmation request"
      - post:
          url: "/otpconfirmation"
          json:
            mandateIdentification: "{{ mandateIdentification }}"
            otpIdentificationNumber: "{{ otpIdentificationNumber }}"
            otpPassword: "{{ otpPassword }}"
            creditorAccount:
              bankCode: "{{ bankCode }}"
              accountIdentification: "{{ accountIdentification }}"
              currency: "{{ currency }}"
              accountSchemeName: "{{ accountSchemeName }}"
              accountSubType: "{{ accountSubType }}"
          headers:
            Authorization: $processEnvironment.AUTH_TOKEN
            x-fapi-customer-ip-address: "192.168.1.1"
            x-fapi-auth-date: "2022-01-01"
            x-fapi-interaction-id: "1"
            x-idempotency-key: "1"
          expect:
            - statusCode: 201
            - hasProperty: "processResult"
            - hasProperty: "processResult.responseCode"
            - hasProperty: "processResult.rejectReasonList"
            - hasProperty: "mandateIdentification"
            - hasProperty: "creditorReference"
      - think: 1