api_tests/user_logout_get_success.yaml
# ********RoostGPT********

# Test generated by RoostGPT for test swagger-artillery-test-ZBIO-5195A using AI Type Open AI and AI Model gpt-4
# 
# Test generated for /user/logout_get for http method type GET in artillery framework
# RoostTestHash=a64e3feb39
# 
# 

# ********RoostGPT********
config:
  target: "{{ $processEnvironment.API_HOST }}"
  plugins:
    expect: {}
  payload:
    path: "user_logout_get_success.csv"
    skipHeader: true
    fields:
      - "username"
      - "password"
  environments:
    development:
      target: "http://dev.api.host"
      phases:
        - duration: 60
          arrivalRate: 5
    staging:
      target: "http://staging.api.host"
      phases:
        - duration: 60
          arrivalRate: 5
    production:
      target: "http://prod.api.host"
      phases:
        - duration: 60
          arrivalRate: 5

scenarios:
  - name: "User logout success scenario"
    flow:
      - log: "Starting user logout scenario"
      - post:
          url: "/v2/user/logout"
          headers:
            api_key: "{{$processEnvironment.AUTH_TOKEN}}"
          expect:
            - statusCode: 200
            - hasProperty: "message"
            - hasProperty: "status"
            - equals:
                - "status"
                - "success"
      - think: 1