api_tests/user_username_get_others.yaml
# ********RoostGPT********

# Test generated by RoostGPT for test swagger-artillery-test-ZBIO-5195A using AI Type Open AI and AI Model gpt-4
# 
# Test generated for /user/{username}_get for http method type GET in artillery framework
# RoostTestHash=da281fe471
# 
# 

# ********RoostGPT********
# Artillery YAML Test Script for Non-Success API Responses

config:
  target: "{{ $processEnvironment.API_HOST }}"
  phases:
    - duration: 60
      arrivalRate: 5
  plugins:
    expect: {}
  payload:
    path: "user_username_get_others.csv"
    fields:
      - "username"
    skipHeader: true

scenarios:
  - name: "Non-Success API Responses Test"
    flow:
      # Testing with incorrect URL
      - get:
          url: "/v2/invalid/{username}"
          headers:
            api_key: "{{$processEnvironment.AUTH_TOKEN}}"
          expect:
            - statusCode: 404

      # Testing with invalid authorization token
      - get:
          url: "/v2/user/{username}"
          headers:
            api_key: "invalid_token"
          expect:
            - statusCode: 401

      # Testing with missing authorization header
      - get:
          url: "/v2/user/{username}"
          expect:
            - statusCode: 401

      # Testing with invalid user name
      - get:
          url: "/v2/user/invalid_username"
          headers:
            api_key: "{{$processEnvironment.AUTH_TOKEN}}"
          expect:
            - statusCode: 404